using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;

// Управление общими сведениями о сборке осуществляется с помощью 
// набора атрибутов. Измените значения этих атрибутов, чтобы изменить сведения,
// связанные со сборкой.
[assembly: AssemblyTitle("ClusterBox")]
[assembly: AssemblyProduct("ClusterBox")]
[assembly: AssemblyCopyright("Copyright ©  2019")]
[assembly: AssemblyDescription("Програмний продукт розроблений в середовищі Microsoft Visual"+
    "Studio 2019 Community на мові програмування C# з використанням елементів Win-Forms." +
    "Призначенням програми є визначення групи ризику студента за допомогою проведення " +
    "проби Мартіне та реєстрації даних у програмі. Також програмою передбачено проведення глобальної" +
    "кластеризації, універсальної кластеризації та регресійного дослідження")]

// Параметр ComVisible со значением FALSE делает типы в сборке невидимыми 
// для COM-компонентов.  Если требуется обратиться к типу в этой сборке через 
// COM, задайте атрибуту ComVisible значение TRUE для этого типа.
[assembly: ComVisible(false)]

// Следующий GUID служит для идентификации библиотеки типов, если этот проект будет видимым для COM
[assembly: Guid("3bf546d2-cab7-4c6d-a1f0-a7ff7e1ed411")]

// Сведения о версии сборки состоят из следующих четырех значений:
//
//      Основной номер версии
//      Дополнительный номер версии 
//   Номер сборки
//      Редакция
//
// Можно задать все значения или принять номера сборки и редакции по умолчанию 
// используя "*", как показано ниже:
// [assembly: AssemblyVersion("1.0.*")]
[assembly: AssemblyVersion("3.0.*")]
